controllers/SiteController.php

		public function actionProfile()
		{
			$model = new ProfileForm();
			if(\Yii::$app->request->post()){
				$user = User::findIdentity(Yii::$app->user->getId());
				$user->ref_key = Yii::$app->security->generateRandomString();
				$ref = $user->ref_key;
				$user->save();
---
UPDATE `users` SET `ref_key`='7E7NJElEINp77ysjiLr3MbRqngtLCAjD' WHERE `id`=2