models/User.php

		public static function findIdentity($id)
		{
			return static::findOne($id);
---
SELECT * FROM `users` WHERE `id` IS NULL

		public static function findByUsername($username)
		{
			return static::findOne(['username' => $username]);
---
SELECT * FROM `users` WHERE `username`='Test1'

		public static function findByReferrer($referrerId)
		{
			return static::findAll(['from' => $referrerId]);
---
SELECT * FROM `users` WHERE `from`=1

		public function validateAuthKey($authKey)
		{
			return static::findOne(['authKey' => $authKey]);
---
SELECT * FROM `users` WHERE `authKey`='yF-5zoQcLF08wGOpkK1HXB-puUEPxTsg'